Repository: pypi-data/pypi-mirror-280
Catalog: packages/artd-shopify/artd_shopify-1.1.7-py3-none-any.whl/artd_shopify/locale/*/LC_MESSAGES/django.po
Languages: es

source: English
es: Ingles

source: Spanish
es: Español

source: ArtD Shopify
es: Shopify

source: status
es: Estado

source: Designates whether this record is active or not.
es: Designa si este registro esta activo o no.

source: created at
es: Creado el

source: Date time on which the object was created.
es: Fecha y hora en la que se creo el objeto.

source: updated at
es: Actualizado el

source: Date time on which the object was last updated.
es: Fecha y hora en la que se actualizo el objeto.

source: partner
es: Asociado

source: Partner associated with this credential.
es: Asociado con este credencial.

source: vendor
es: Vendedor

source: Shopify Vendor.
es: Vendedor Shopify.

source: API version
es: Versión API

source: Shopify API Version.
es: Versión API Shopify.

source: API key
es: Llave API

source: Shopify API Key.
es: Llave API Shopify.

source: API password
es: Contraseña API

source: Shopify API Password.
es: Contraseña API Shopify.

source: store URL
es: URL de la tienda

source: Shopify Store URL.
es: URL de la tienda Shopify.

source: callback URL
es: URL de retorno

source: Shopify Callback URL.
es: URL de retorno Shopify.

source: auth URL
es: URL de autenticación

source: Shopify Auth URL.
es: URL de autenticación de Shopify

source: access token
es: Token de acceso

source: Shopify Access Token.
es: Token de acceso Shopify

source: Vendor
es: Vendedor

source: store key
es: Llave de la tienda

source: Shopify Store Key.
es: Llave de la tienda Shopify

source: product counter
es: Contador de productos

source: Shopify Product Counter.
es: Contador de productos Shopify

source: brand prefix
es: Prefijo de marca

source: Shopify Brand Prefix.
es: Prefijo de marca Shopify

source: category regular expression
es: Expresión regular de categoría

source: Shopify Category Regular Expression.
es: Expresión regular de categoría Shopify

source: API secret
es: API secreta

source: Shopify API Secret.
es: API secreta de Shopify

source: product id
es: ID del producto

source: Shopify Product ID.
es: ID del producto Shopify

source: name
es: Nombre

source: Shopify Product Name.
es: Nombre del producto Shopify

source: json data
es: Datos JSON

source: Shopify Product JSON Data.
es: Datos JSON del producto Shopify

source: Partner associated with this product.
es: Asociado con este producto.

source: processed
es: Procesado

source: Designates whether this product is processed or not.
es: Designa si este producto esta procesado o no.

source: Shopify Category Name.
es: Nombre de la categoría Shopify

source: artd partner
es: Asociado

source: ArtD Partner associated with this category.
es: Asociado con esta categoría.

source: artd tax
es: Impuesto

source: ArtD Tax associated with this category.
es: Impuesto asociado con esta categoría.

source: Shopify Category JSON Data.
es: Data JSON de la categoría Shopify

source: Shopify Brand Name.
es: Nombre de la marca Shopify
